
* Hadan
** Этапы
*** Возможность симуляции стратегии на тестовых данных
**** Что нужно для этого
***** TODO Биндинг к базе данных с поддержкой Decimal
****** TODO Сделать патч к HDBC и добавить в него поддержку Decimal
******* DONE Сделать патч к convertible и добавить поддержку Decimal
******** DONE Сделать патч к Decimal и добавить fromRational и Typeable
******* DONE Пересмотреть SqlValue сократить и упростить
******* DONE Пересмотреть код HDBC
******** DONE Структурировать знание по HDBC в его текущем состоянии
         CLOCK: [2013-03-07 Чт. 12:45]--[2013-03-07 Чт. 17:01] =>  4:16
******** DONE Четко определить задачи, решаемые библиотекой
******** DONE Продумать архитектуру главной библиотеки и драйверов
         
******* TODO Переписать HDBC в соответствии с задачами
******** TODO Доделать Convertible
********* TODO Заменить условную компиляцию Decimal 0.2.4 на 0.3.1
******** TODO Переделать сам пакет HDBC
         CLOCK: [2013-03-16 Сб. 14:00]--[2013-03-16 Сб. 14:58] =>  0:58
         CLOCK: [2013-03-15 Пт. 14:21]--[2013-03-15 Пт. 19:00] =>  4:39
         CLOCK: [2013-03-15 Пт. 12:59]--[2013-03-15 Пт. 13:05] =>  0:06
********* DONE SqlValue
          CLOCK: [2013-03-16 Сб. 14:58]--[2013-03-16 Сб. 15:18] =>  0:20
          Убрать все что не относится к
********* DONE Connection
          CLOCK: [2013-03-16 Сб. 15:18]--[2013-03-16 Сб. 15:40] =>  0:22
********* DONE Statement
          CLOCK: [2013-03-16 Сб. 17:11]--[2013-03-16 Сб. 17:47] =>  0:36
          Оставить только интерфейс
********* DONE Utils
          CLOCK: [2013-03-16 Сб. 18:54]--[2013-03-16 Сб. 19:53] =>  0:59
          CLOCK: [2013-03-16 Сб. 17:47]--[2013-03-16 Сб. 17:53] =>  0:06
          Оставить только
          1. fromSql, toSql и аналоги
          2. withConnection ConnWrapper
          3. withTransaction
          4. run и аналогичные функции, которые
             безопасно, в bracket выполняют создание
             Statement и финализируют его по завершении запроса
          5. Убрать операции с ленивыми списками
********* DONE DriverUtils
          CLOCK: [2013-03-17 Вс. 01:06]--[2013-03-17 Вс. 01:53] =>  0:47
          1. Заменить Mvar на IORef и сделать безопасный
             апдейт значения
********* DONE Переделать Statement
          Убрать возврат affectedRows и вместо него
          сделать два дополнительных вызова
          1. affectedRows - количетво строк, затронутых запросом
          2. lastID - последний ID после инсерта
********* DONE Провреить Typeable, везде должно быть deriving
********* DONE Переделать интерфейсы Connection и Statement
          Убрать явное выбрасывание исключений и сделать
          безопасный интерфейс на Either и
          соответствющие обертки, выбрасывающие
          исключение, если Left
********* DONE Добавить методы для интерфейсов
          1. Проверка статуса соединения и выроажения
          2. Проверка статуса транзакции в соединении
********* DONE Переделать Statement в тайпкласс по аналогии c Connection
          CLOCK: [2013-03-20 Ср. 10:35]--[2013-03-20 Ср. 12:38] =>  2:03
********* DONE Удалить условную компиляцию для GHC < 6.10
          CLOCK: [2013-03-20 Ср. 12:39]--[2013-03-20 Ср. 12:50] =>  0:11
********* DONE Вернуть обратно врапперы для Connection и Statement
********* DONE Cabal file
********* TODO Документация в HDBC
          Самое главное - написать главное пояснение за
          новый HDBC, чтобы вопросов не было что это и
          зачем переписано со старого
********** TODO Документация по модулям
           CLOCK: [2013-03-22 Пт. 12:10]--[2013-03-22 Пт. 14:49] =>  2:39
           CLOCK: [2013-03-21 Чт. 11:55]--[2013-03-21 Чт. 13:00] =>  1:05
********** TODO Вступительное пояснение
********* TODO Переработать строки
********** TODO Убрать String в запросах, заменить на Text
********** TODO SqlByteString -> SqlBlob, SqlString -> SqlText
********* TODO tests
********* Запросы в ByteString
          Для быстрейшей генерации запросов можно
          сделать обертку над ByteString чтобы можно
          было быстро генерировать запросы
********* SqlString заменить строку на Text
          Текста может быть очень много, возможно
          String не лучший выбор для хранения текста.
******** TODO Переделать пакет hdbc-sqlite3
******** TODO Переделать пакет hdbc-postgresql
******** TODO Создать пакет hdbc-mysql
******* TODO Переписать документацию в пакетах
***** TODO Монада Strategy
      
*** Возможность выставления заявок в Quik
**** Что нужно для этого
***** TODO DDE сервер для получения данных от Quik
***** TODO Биндинг к Quik для выставления заявок
